Show / Hide Table of Contents
Class ArcSegment3D
Represents an arc segment in three-dimensional space.
Inheritance
System.Object
OpenObject
OpenElementId
Segment3D
ArcSegment3D
Inherited Members
 Segment3D.StartPoint
 Segment3D.EndPoint
 Segment3D.LocalCoordinateSystem
 OpenElementId.Id
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Geometry3D
Assembly: IdeaRS.OpenModel.dll
Syntax
[OpenModelClass("CI.Geometry3D.ArcSegment3D,CI.Geometry3D", "CI.Geometry3D.IArcSegment3D,CI.BasicTypes")]
public class ArcSegment3D : Segment3D
Properties
Improve this Doc   View Source
Point
Gets or sets the reference to Point3D of circular arc somewhere between start and end point.
Declaration
public ReferenceElement Point { get; set; }
Property Value
 Type |  Description
 ReferenceElement
 Improve this Doc
 View Source